<?php

use Illuminate\Database\Seeder;
use Faker\Factory as Faker;
use File as File;
use App\Role;
use App\User;
use App\MainQueue;
use App\UserQueue;
use Carbon\Carbon;
use App\QueueType;
class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $m = MainQueue::all();
        foreach ($m as $key => $ma) {
            $ma->userqueue()->detach();
        }
        
        $contents = \File::allFiles('public/files');
        foreach ($contents as $key => $file) {
           File::delete($file);
        }

        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        $this->call('RoleSeeder');
        $this->call('QueueTypeSeeder');
        $this->call('AdminSeeder');
        $this->call('UserQueueSeeder');
        $this->call('MainQueueSeeder');
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');
    }
}
class RoleSeeder extends Seeder {
    public function run() {    
        Role::truncate();
        Role::create(['name'=>'administrator','description'=>'full access']);
        Role::create(['name'=>'user','description'=>'basic access']);
        Role::create(['name'=>'moderator','description'=>'manage']);
    }
} 
class AdminSeeder extends Seeder{
    public function run() {    
        User::truncate();
        User::create([
            'name' => 'ผู้จัดการ สาขา',
            'username' => 'admin1',
            'password' => bcrypt('123456789'),
            'email' => 'admin@symple.world',
            'phone' => '0815385925',
            'role_id' => 1,
            'counter_id' => 1
            ]);
        User::create([
            'name' => 'พนักงาน คนสวย',
            'username' => 'testmod1',
            'password' => bcrypt('123456789'),
            'email' => 'modx@gmail.com',
            'phone' => '0812556789',
            'role_id' => 3,
            'counter_id' => 2
            ]);
        User::create([
            'name' => 'สมชาย ใจดี',
            'username' => 'testuser1',
            'password' => bcrypt('123456789'),
            'email' => 'pozterz3@gmail.com',
            'phone' => '0812345678',
            'role_id' => 2,
            'counter_id' => 0
            ]);
        User::create([
            'name' => 'สมพร นอนดึก',
            'username' => 'testuser2',
            'password' => bcrypt('123456789'),
            'email' => 'pozterz2@gmail.com',
            'phone' => '0819876543',
            'role_id' => 2,
            'counter_id' => 0
            ]);
        User::create([
            'name' => 'พนักงาน คนสวยกว่า',
            'username' => 'testmod2',
            'password' => bcrypt('123456789'),
            'email' => 'modx2@gmail.com',
            'phone' => '0814321120',
            'role_id' => 3,
            'counter_id' => 3
            ]);
        //Role::create(['name'=>'user','description'=>'basic access']);
    }
}
  
class QueueTypeSeeder extends Seeder {
    public function run() {    
        QueueType::truncate();
        QueueType::create([
            'name'=>'สินเชื่อส่วนบุคคล',
            'requirement'=>'• ผู้สมัครมีอายุระหว่าง 20-60 ปี
• รายได้ขั้นต่ำ
20,000 บาท สำหรับพนักงานประจำ (ได้รับการบรรจุเป็นพนักงานแล้ว)
30,000 บาท สำหรับเจ้าของธุรกิจ
• มีหมายเลขโทรศัพท์ที่บ้านหรือที่ทำงานที่ติดต่อได้',
            'document'=>'• สำเนาบัตรประชาชน  หรือ สำเนาบัตรข้าราชการ/สำเนาบัตรรัฐวิสาหกิจ พร้อมแนบสำเนาทะเบียนบ้าน 
• เอกสารแสดงรายได้ กรณีพนักงานประจำ สลิปเงินเดือน เดือนปัจจุบัน หรือหนังสือรับรองการทำงาน (ระบุ เงินเดือน ตำแหน่ง และอายุงาน)
• สำเนาใบแจ้งยอดเงินฝากย้อนหลัง 3 เดือน นับจากเดือนปัจจุบัน  (บัญชีเงินเดือนเข้า) เอกสารแสดงรายได้ กรณีผู้ประกอบธุรกิจส่วนตัว
• สำเนาหนังสือรับรองการจดทะเบียนบริษัท/ห้างหุ้นส่วนจำกัด จากกระทรวงพาณิชย์ หรือใบทะเบียนพาณิชย์
• สำเนาบัญชีเงินฝากย้อนหลัง 6 เดือน (บัญชีส่วนตัว) สำเนาบัญชีเงินฝากหน้าแรกที่ต้องการให้โอนเงินกู้เข้าบัญชี (ต้องเป็นชื่อผู้สมัครเพียงผู้เดียวเท่านั้น)',
            'description' => '• สมัครง่ายโดยไม่ต้องมีหลักทรัพย์หรือบุคคลค้ำประกัน
• เมื่อสินเชื่อได้รับการอนุมัติ ธนาคารจะโอนเงินกู้เข้าบัญชีธนาคารที่ลูกค้าได้แจ้งความประสงค์ไว้
1 วันสำหรับบัญชีธนาคารไทยพาณิชย์
3 วันสำหรับบัญชีธนาคารอื่น
• วงเงินอนุมัติตั้งแต่ 20,000 - 2,000,000 บาท
- 20,000 - 30,000 บาท     ผ่อนได้สูงสุด 24 เดือน
- 30,001 บาทขึ้นไป             ผ่อนได้สูงสุด 60 เดือน
- 300,000 บาทขึ้นไป           ผ่อนได้สูงสุด 72 เดือน
• ชำระคืนธนาคารเป็นรายเดือนๆ ละเท่าๆ กัน
• จุดชำระเงิน
- ธนาคารไทยพาณิชย์ทุกสาขาทั่วประเทศ
- เคาน์เตอร์เซอร์วิส / 7-11
- ศูนย์บริการทีโอที / TOT Shop และจุดบริการที่มีเครื่องหมาย Just Pay
- สำนักงานบริการเอไอเอสและร้านเทเลวิซทุกสาขา
- ที่ทำการไปรษณีย์ทุกสาขา
- Tesco Lotus และ Tesco Lotus Express ทุกสาขา
• คิดอัตราดอกเบี้ยแบบลดต้นลดดอก'
]);
        QueueType::create([
            'name'=>'สินเชื่อเงินสด',
            'requirement'=>'• ผู้สมัครมีอายุระหว่าง 20-60 ปี
• มีหมายเลขโทรศัพท์ที่บ้านหรือที่ทำงานที่ติดต่อได้',
            'document'=>'• สำเนาบัตรประชาชน หรือ หากเป็น สำเนาบัตรข้าราชการ/สำเนาบัตรรัฐวิสาหกิจต้องแนบสำเนาทะเบียนบ้าน
• เอกสารแสดงรายได้ กรณีผู้มีรายได้ประจำ
-  สลิปเงินเดือน เดือนปัจจุบัน หรือหนังสือรับรองการทำงาน(ระบุเงินเดือนตำแหน่ง และอายุงาน) 
-  สำเนาบัญชีเงินฝากย้อนหลัง 3 เดือน
• เอกสารแสดงรายได้ กรณีผู้ประกอบธุรกิจส่วนตัว
-  สำเนาหนังสือรับรองการจดทะเบียนบริษัท / ห้างหุ้นส่วนจำกัด จากกระทรวงพาณิชย์ หรือใบทะเบียนพาณิชย์ 
-  สำเนาบัญชีเงินฝากย้อนหลัง 6 เดือน (บัญชีส่วนตัว)',
            'description' => 'ลักษณะบริการ
• เป็นวงเงินที่ธนาคารให้ลูกค้าสำรองไว้ใช้ในยามฉุกเฉิน ถ้าลูกค้าไม่มีการเบิกถอนเงินสดก็ไม่ต้องเสียดอกเบี้ย
• สมัครง่าย โดยที่ลูกค้าไม่ต้องมีบัญชีกับธนาคาร และไม่ต้องมีหลักทรัพย์หรือบุคคลค้ำประกัน เพียงมีรายได้ขั้นต่ำ 15,000 บาทขึ้นไป
• วงเงินเริ่มต้นที่ 10,000 บาท สูงสุดไม่เกิน 1,500,000 บาท
วิธีเบิกใช้วงเงิน
• เบิกเงินสดได้ทันทีตลอด 24 ชั่วโมง ผ่านเครื่อง ATM ที่มีเครื่องหมาย ATM POOL
• สามารถโอนเงินเข้าบัญชีออมทรัพย์หรือบัญชีกระแสรายวันของท่าน ที่มีอยู่กับธนาคารไทยพาณิชย์ ผ่าน SCB easy net
• ผ่อนชำระค่าสินค้า / บริการกับระบบผ่อนชำระของธนาคารกับร้านค้าร่วมรายการ
จุดเด่น
• ไม่เสียค่าธรรมเนียมในการเบิกถอนเงินสด / ค่าธรรมเนียมการใช้วงเงิน
• ไม่มีค่าธรรมเนียมอื่นๆ เช่น การขอบัตรใหม่, การออกบัตรใหม่
• เลือกชำระคืนได้ 2 แบบ โดยที่ลูกค้าสามารถเลือกชำระเต็มจำนวน หรือ ชำระคืนขั้นต่ำ 3 % ของยอดเงินที่เรียกเก็บในแต่ละรอบบัญชี หรือไม่น้อยกว่า 300 บาท (แล้วแต่จำนวนใดจะสูงกว่า)
• สะดวกสบายกับหลายช่องทางการชำระคืน
-  ชำระโดยหักบัญชีธนาคารไทยพาณิชย์
-  ชำระผ่านเครื่อง ATM ธนาคารไทยพาณิชย์
-  ชำระผ่านเคาน์เตอร์ ธนาคารไทยพาณิชย์
-  ชำระผ่านระบบโทรศัพท์อัตโนมัติ
-  ชำระผ่านระบบอินเตอร์เน็ต (www.scbeasy.com)
-  ชำระผ่านเครื่องรับฝากเงินอัตโนมัติ (CDM)
-  ชำระผ่านเคาน์เตอร์เซอร์วิส / 7-11
-  ชำระผ่านธนาคารออมสิน
-  ชำระผ่านที่ทำการไปรษณีย์
-  ชำระผ่านร้าน TOT shop
-  ชำระผ่านศูนย์บริการ AIS และ เทเลวิส
-  ชำระผ่านเทสโก้ โลตัส เอ็กซ์เพรสทุกสาขา']);

        QueueType::create([
            'name' => 'สินเชื่ออเนกประสงค์',
            'requirement' => '1. เป็นบุคคลธรรมดา มีสัญชาติไทย
2. อายุ 20 ปีบริบูรณ์ขึ้นไป',
            'document' => '         
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- สำเนาเอกสารแสดงกรรมสิทธิ์หลักประกัน
- สำเนาใบเสร็จรับชำระเงินกู้จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน (กรณี Refinance)
',
            'description' => 'จุดเด่น
1. วงเงินกู้สูงสุด 10 ล้านบาท
2. ผ่อนสบาย นานสูงสุด 30 ปี
3. ผ่อนชำระแบบ ลดต้น ลดดอก
4. อนุมัติง่าย ไม่ต้องมีผู้ค้ำ
5. ไม่เสียค่าธรรมเนียม เมื่อปิดบัญชีก่อนกำหนด
6. ไม่ต้องระบุวัตถุประสงค์การกู้ ใช้จ่ายอะไรก็ได้ ตามใจคุณ']);

        QueueType::create([
            'name' => 'สินเชื่อบ้านเพื่อที่อยู่อาศัย',
            'requirement' => '1.  มีสัญชาติไทย
2.  อายุ 20 ปีบริบูรณ์
3.  ผู้กู้หลักต้องมีรายได้ตั้งแต่ 15,000 บาทต่อเดือนขึ้นไป',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- สำเนาเอกสารแสดงกรรมสิทธิ์หลักประกัน
- สำเนาใบเสร็จรับชำระเงินกู้จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน (กรณี Refinance)',
            'description' => '
1.วงเงินกู้สูงสุด 100%* ของราคาประเมินหลักประกัน
2.  อัตราดอกเบี้ยมีให้เลือกหลากหลายแบบ ทั้งอัตราดอกเบี้ยคงที่ หรืออัตราดอกเบี้ยลอยตัว
3.  มีสาขาธนาคารพร้อมให้บริการกว่า 1,000 สาขา
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระ รวมอายุผู้กู้แล้วต้องไม่เกิน 65 ปี หรือ 70 ปี(กรณีเป็นเจ้าของกิจการ)'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อบ้าน รีไฟแนนซ์',
            'requirement' => '1. เป็นลูกค้าที่ผ่อนชำระสินเชื่อเคหะกับสถาบันการเงินอื่นมาแล้วไม่ต่ำกว่า 2 ปี
2. อายุ 20 ปีบริบูรณ์
3. มีสัญชาติไทย',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- สำเนาเอกสารแสดงกรรมสิทธิ์หลักประกัน
- สำเนาใบเสร็จรับชำระเงินกู้จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน (กรณี Refinance)',
            'description' => '
1. วงเงินกู้สูงสุด 100% ของราคาประเมินหลักประกัน
2. อัตราดอกเบี้ยมีให้เลือกหลากหลายแบบ ทั้งอัตราดอกเบี้ยคงที่ หรืออัตราดอกเบี้ยลอยตัว
3. กู้เพิ่มจากยอดหนี้เดิมได้สูงสุด 10 ล้านบาท
4. ผ่อนนานสูงสุด 30 ปี
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระ รวมอายุผู้กู้แล้วต้องไม่เกิน 65 ปี หรือ 70 ปี(กรณีเป็นเจ้าของกิจการ)'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อเพื่อการเคหะ',
            'requirement' => '',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- สำเนาเอกสารแสดงกรรมสิทธิ์หลักประกัน
- สำเนาใบเสร็จรับชำระเงินกู้จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน (กรณี Refinance)',
            'description' => '
• วงเงินกู้สูงสุด 90% ของราคาประเมินหลักประกัน ทั้งนี้ตามหลักเกณฑ์และเงื่อนไขการอนุมัติของธนาคาร
• ผ่อนนานถึง 30 ปี โดยอายุผู้กู้รวมระยะเวลากู้ไม่เกิน 65 ปี
• สามารถของวงเงินเพื่อชำระค่าเบี้ยประกันภัยของ "บริการประกันสุข" ได้แก่ กลุ่ม ประกันชีวิต, กลุ่มประกันสุขภาพ และกลุ่มประกันทรัพย์สิน
• อัตราดอกเบี้ยคงที่ หรืออัตราดอกเบี้ยลอยตัวอ้างอิงอัตราดอกเบี้ย MRR
• ทำประกันอัคคีภัย พิทักษ์ภัย ได้ตั้งแต่ 2-30 ปี
']);
        QueueType::create([
            'name' => 'สินเชื่อบ้านได้เพิ่ม',
            'requirement' => '1. เฉพาะลูกค้าสินเชื่อบ้าน SCB ที่ใช้บริการสินเชื่อบ้าน ตั้งแต่ 2 ปีขึ้นไป
2. อายุ 20 ปีบริบูรณ์
3. มีสัญชาติไทย',
            'document' => '           
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส โปรดแนบ 
* สำเนาบัตรประชาชนคู่สมรส 
* สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
- สำเนาบัตรประชาชนผู้ค้ำประกัน (ถ้ามี)
- สำเนาบัตรประชาชนผู้จำนอง/ผู้จำนำ 
(กรณีผู้จำนอง/ผู้จำนำ กับผู้สมัครไม่ใช่ 
บุคคลเดียวกัน)
- สำเนาหน้าสมุดบัญชีเงินฝากออมทรัพย์ 
ของ SCB (ยกเว้นบัญชีเงินฝากออมทรัพย์ 
ร่มโพธิ์, บัญชีเพื่อ.../โดย...)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดาที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดาที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน (บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, ทนายความ, สถาปนิก)',
            'description' => '
1. รับวงเงินกู้เพิ่มสูงสุด 5 ล้านบาท
2. รับเงินเพิ่ม...ผ่อนเท่าเดิม
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระรวมอายุผู้กู้แล้ว ต้องไม่เกิน 65 ปี หรือ 70 ปี (กรณีเป็นเจ้าของกิจการ)

หมายเหตุ :
* เป็นลูกค้าสินเชื่อบ้านรายเก่าของธนาคาร ที่มีผลการผ่อนชำระตรงตามเงื่อนไข (ผ่อนเท่ากับอัตราผ่อนชำระต่อเดือนที่ธนาคารฯ กำหนด)
** ธนาคารฯ ขอสงวนสิทธิ์ในการพิจารณาทบทวนการให้สินเชื่อ และ/หรือ เปลี่ยนแปลงวงเงินให้สินเชื่อ หรือไม่ผ่านการอนุมัติวงเงินตามหลักเกณฑ์ที่ธนาคารฯ กำหนดโดยไม่ต้องแจ้งให้ทราบล่วงหน้า ทั้งนี้ ท่านจะเบิกใช้สินเชื่อได้ก็ต่อเมื่อได้มีการจัดทำเอกสารตามแบบเงื่อนไขและ วิธีการที่ธนาคารฯ กำหนดครบถ้วน และธนาคารฯได้พิจารณาอนุมัติในขั้นตอนสุดท้ายแล้ว รวมทั้งได้มีการเพิ่มวงเงินจำนองตามรายละเอียดที่ธนาคารฯ แจ้งให้ทราบ (ในกรณีที่ยอดหนี้เดิมของท่านและวงเงินสินเชื่อที่ธนาคารฯ อนุมัติดังกล่าวมีจำนวนเกินกว่าวงเงินจำนองเดิม'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อบ้านสวัสดิการพนักงานองค์กร',
            'requirement' => '1.  มีสัญชาติไทย
2.  อายุ 20 ปีบริบูรณ์
3.  ผู้กู้หลักต้องมีรายได้ตั้งแต่ 15,000 บาทต่อเดือนขึ้นไป',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- ภาพถ่ายแสดงกรรมสิทธิ์หลักประกัน
- สัญญาซื้อขาย
- สำเนาใบเสร็จรับเงินกรณีผ่อนชำระกู้
จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน
(กรณี Refinance)',
            'description' => '
1.  วงเงินกู้สูงสุด 100%* ของราคาประเมินหลักประกัน
2.  ระยะเวลากู้นานสูงสุด 30 ปี
3.  อัตราดอกเบี้ยมีให้เลือกหลากหลายตามความต้องการของลูกค้าองค์กร 
    มีทั้งแบบอัตราดอกเบี้ยคงที่ และอัตราดอกเบี้ยลอยตัว
4.  อำนวยความสะดวกในการติดต่อรับเอกสารได้ที่บริษัท หรือฝากเอกสารไว้กับ
    ทางฝ่ายบุคคลของบริษัทนั้นๆ
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระ รวมอายุผู้กู้แล้วต้องไม่เกิน 65 ปี
• เงื่อนไข
1.  ในบางบริษัทที่มีการช่วยเหลือดอกเบี้ยจ่ายพนักงานจะต้องได้รับการอนุมัติวงเงินจากทางฝ่ายบุคคลก่อน 
2.  ผู้กู้ต้องเป็นพนักงานประจำและมีอายุงานมากกว่า 1 ปีขึ้นไป
หมายเหตุ
* การอนุมัติวงเงินขึ้นอยู่กับเงื่อนไขของธนาคารฯ'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อเพื่อผู้ประกอบวิชาชีพเฉพาะ',
            'requirement' => '1. มีสัญชาติไทย
2. อายุ 20 ปีบริบูรณ์
3. เป็นบุคคลธรรมดาที่ประกอบอาชีพ แพทย์ ทันตแพทย์ สัตวแพทย์ เภสัชกร อัยการ ผู้พิพากษา และอาจารย์มหาวิทยาลัยระดับผู้ 
ช่วยศาสตราจารย์หรือเทียบเท่าขึ้นไป',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- ภาพถ่ายแสดงกรรมสิทธิ์หลักประกัน
- สัญญาซื้อขาย
- สำเนาใบเสร็จรับเงินกรณีผ่อนชำระกู้
จากสถาบันการเงินเดิมย้อนหลัง 6 เดือน
(กรณี Refinance)',
            'description' => '
1. วงเงินกู้สูงสุด 100% ของราคาประเมินหลักประกัน
2. อัตราดอกเบี้ยมีให้เลือกหลากหลายแบบ ทั้งอัตราดอกเบี้ยคงที่ หรืออัตราดอกเบี้ยลอยตัว
3. ผ่อนนานสูงสุด 30 ปี
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระ รวมอายุผู้กู้แล้วต้องไม่เกิน 65 ปี หรือ 70 ปี (กรณีเป็นเจ้าของกิจการ)'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อเพื่อปลูกสร้างบ้าน',
            'requirement' => '1. มีสัญชาติไทย
2. อายุ 20 ปีบริบูรณ์
3. ผู้กู้หลักต้องมีรายได้ตั้งแต่ 15,000 บาท ต่อเดือนขึ้นไป',
            'document' => '
• เอกสารข้อมูลส่วนบุคคล
- สำเนาบัตรประชาชน หรือบัตรข้าราชการ
- สำเนาทะเบียนบ้าน
- สำเนาทะเบียนสมรส
- สำเนาใบเปลี่ยนชื่อ-นามสกุล (ถ้ามี)
• เอกสารแสดงรายได้
กรณีบุคคลธรรมดา
ที่มีรายได้ประจำ
- ใบรับรองเงินเดือน หรือรายได้ และสลิปเงินเดือน
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
กรณีบุคคลธรรมดา
ที่ประกอบธุรกิจส่วนตัว
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน 
(บัญชีส่วนตัว, บัญชีกิจการ)
กรณีบุคคลธรรมดาที่ประกอบอาชีพอิสระ
- เอกสารการเดินบัญชีย้อนหลัง 6 เดือน
- ใบอนุญาตประกอบวิชาชีพ (แพทย์, วิศวกร, 
ทนายความ, สถาปนิก)
• เอกสารเกี่ยวกับหลักประกัน
- ภาพถ่ายโฉนดที่ดินหน้า-หลัง
- แบบก่อสร้างและรายการวัสดุ
- สัญญาว่าจ้างปลูกสร้าง
- ใบอนุญาตก่อสร้าง',
            'description' => '
- วงเงินกู้สูงสุด 100% ของค่าจ้างปลูกสร้าง (กรณีที่ดินปลอดภาระ)
- วงเงินกู้รวมสูงสุด 90% ของราคาประเมินที่ดินและสิ่งปลูกสร้าง
- วงเงินกู้เพิ่มสูงสุด 30% เพื่อตกแต่งบ้าน หรือซื้อเฟอร์นิเจอร์ได้ตามใจ ตามเงื่อนไขโปรแกรม Home Builder Plus
- เบิกจ่ายงวดงานตรงตามเวลา
- อัตราดอกเบี้ยมีให้เลือกหลากหลายแบบ ทั้งอัตราดอกเบี้ยคงที่ หรืออัตราดอกเบี้ยลอยตัว
- สะดวกรวดเร็วด้วยบริการจากทีมขาย รับเอกสาร เซ็นสัญญานอกสถานที่
• ระยะเวลาการผ่อนชำระ
ระยะเวลากู้นานสูงสุด 30 ปี และระยะเวลาผ่อนชำระ รวมอายุผู้กู้แล้วต้องไม่เกิน 65 ปี หรือ 70 ปี (กรณีเป็นเจ้าของกิจการ)'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อธุรกิจรายย่อย',
            'requirement' => '1. ผู้ประกอบการธุรกิจ นิติบุคคล หรือ บุคคลธรรมดา ที่มีอายุ 20 ปีขึ้นไป
2. มีประสบการณ์ในการดำเนินกิจการอย่างน้อย 1 ปี
3. มีที่ตั้งกิจการเป็นหลักแหล่ง สามารถแสดงแหล่งที่มาของรายได้ ได้อย่างชัดเจน
หมายเหตุ
*  คุณสมบัติและเอกสารประกอบของลูกค้า ทั้งนี้การพิจารณาอนุมัติสินเชื่อเป็นไปตามเงื่อนไข และหลักเกณฑ์ที่ 
    ธนาคารฯ กำหนด    
** หลักประกัน คืออสังหาริมทรัพย์ บ้านพักอาศัย สถานประกอบการ ฯลฯ 
',
            'document' => '',
            'description' => '
• เพิ่มทุน/ต่อยอดได้ สูงสุด 5 ล้านบาท
• ผ่อนชำระได้นาน สูงสุดถึง 10 ปี
• สินเชื่อที่ตอบสนองความต้องการที่หลากหลายของธุรกิจเล็กๆ
- เจ้าของกิจการที่ต้องการเงินทุนสูงกว่าหลักประกัน (สูงสุดถึง 200% ของมูลค่าหลักประกัน**)
- เจ้าของกิจการที่ใช้วงเงินกับสถาบันการเงินอื่นอยู่ และต้องการอัตราดอกเบี้ยพิเศษ
- เจ้าของกิจการหรือบุคคลทั่วไปที่มองเห็นโอกาสใหม่ๆ เพื่อแตกแขนงธุรกิจ
- เจ้าของกิจการที่ต้องการสินเชื่อธุรกิจที่ไม่ต้องมีหลักประกัน
- แพทย์ ทันตแพทย์ เภสัชกร และสัตวแพทย์ ที่ต้องการประกอบกิจการ คลินิก หรือร้านยา'
        ]);
        QueueType::create([
            'name' => 'สินเชื่อรถยนต์',
            'requirement' => '1. อายุ 20 - 60 ปี (เมื่อรวมระยะเวลาผ่อนแล้วไม่เกิน 60 ปี)',
            'document' => '
• สำเนาทะเบียนบ้าน
• สำเนาบัตรประชาชน
• สลิปเงินเดือน หรือหนังสือรับรองเงินเดือน
• สำเนาบัญชีเงินฝากย้อนหลัง 3 เดือน
• Statement หรือ สำเนาบัญชีเงินฝากย้อนหลัง 3 เดือน
• กรณีเจ้าของกิจการ ใช้หนังสือรับรองของสำนักงานทะเบียนหุ้นส่วนบริษัท และ ใบทะเบียนพาณิชย์ อายุไม่เกิน 6 เดือน',
            'description' => '
• อัตราดอกเบี้ยคงที่ และผ่อนชำระเป็นรายงวดๆ ละ เท่าๆ กัน โดยไม่ต้องนำทรัพย์สิน มาเป็นหลักประกัน
• เลือกผ่อนสบายๆ นานสูงสุด 60 งวด
• เมื่อผ่อนชำระครบถ้วนตามสัญญา กรรมสิทธิ์จะโอนเป็นของลูกค้า'
        ]);
        QueueType::create([
            'name' => 'บริการเงินโอนต่างประเทศขาเข้า',
            'requirement' => '',
            'document' => 'เอกสารหลักฐานประกอบตามวัตถุประสงค์เงินโอนต่างประเทศ ตามที่ธนาคารแห่งประเทศไทยกำหนด',
            'description' => '
• ลักษณะของบริการ
ธนาคารให้บริการรับชำระค่าสินค้าและบริการสำหรับผู้ขายหรือผู้ส่งออกผ่าน ระบบ SWIFT เพียงผู้ขายหรือผู้ส่งออกแจ้งให้ผู้ซื้อหรือผู้นำเข้าในต่างประเทศทราบ ข้อมูลของธนาคารไทยพาณิชย์*
เมื่อธนาคารไทยพาณิชย์ได้รับเงินโอนจากธนาคารในต่างประเทศ ธนาคารจะดำเนินการแจ้งผู้ขายหรือผู้ส่งออกเพื่อนำเงินเข้าบัญชี
*ผู้ขายหรือผู้ส่งออกสินค้า ต้องแจ้งข้อมูลบัญชีของท่าน ให้กับคู่ค้าทราบ ดังนี้
1. เลขที่บัญชีธนาคารไทยพาณิชย์
2. ชื่อธนาคาร: Siam Commercial Bank PCL
3. รหัสธนาคาร (SWIFT CODE): SICOTHBK
• จุดเด่นของบริการ
โอนเงินเข้าบัญชี รวดเร็ว หลังจากที่ทราบการตกลงในเรื่องอัตราแลกเปลี่ยน
รองรับการโอนเงินจากต่างประเทศได้ทั่วทุกมุมโลก ผ่านเครือข่ายธนาคารพันธมิตร
บริการรับทำรายงานธุรกรรมเงินตราต่างประเทศ ตามที่ธนาคารแห่งประเทศไทยกำหนดสะดวกกับศูนย์ธุรกิจต่างประเทศของธนาคารที่ ครอบคลุมทั่วประเทศ'
        ]);
         QueueType::create([
            'name' => 'บริการเงินโอนต่างประเทศขาออก',
            'requirement' => '',
            'document' => '
- แบบฟอร์มคำขอโอนเงินต่างประเทศ*
- เอกสารหลักฐานประกอบตามวัตถุประสงค์เงินโอนต่างประเทศ ตามที่ธนาคารแห่งประเทศไทยกำหนด',
            'description' => '
• จุดเด่นของบริการ
- สามารถทำรายการโอนเงินด้วยตนเอง ผ่านระบบออนไลน์ของธนาคารที่สะดวก ใช้งานง่าย และมีความปลลอดภัยสูงตามมาตรฐานสากล ซึ่งช่วยให้ประหยัดเวลาและค่าใช้จ่ายในการดำเนินงาน
- สามารถโอนเงินได้ครั้งละหลายรายการในคำสั่งครั่งเดียว (Bulk Payment)
- รองรับการโอนเงินด้วยสกุลเงินตราต่างประเทศที่คลอบคลุม อาทิ USD, EUR, GBP, JPY, SGD, HKD, AUD, CAD, DKK, NZD, SEK, NOK, CNY และ AED เป็นต้น
- บริการแจ้งรายละเอียดการโอนเงินผ่านทาง e-mail เมื่อธานาคารโอนเงินตามคำขอเรียบร้อยแล้ว
- บริการรับทำรายงานธรุกรรมเงินตราต่างประเทส ตามที่ธนาคารแห่งประเทศไทยกำหนด
- สะดวกกับศูนย์ธุรกิจต่างประเทศของธนาคารที่ครอบคลุมทั่วประเทศ'
        ]);
         /*QueueType::create([
            'name' => '',
            'requirement' => '',
            'document' => '',
            'description' => '',
        );*/
        /*QueueType::create([
            'name' => '',
            'requirement' => '',
            'document' => '',
            'description' => '',
        );*/
    }
}

class UserQueueSeeder extends Seeder{
    public function run() {    
        UserQueue::truncate();
        $faker = Faker::create();
        UserQueue::create([
            'user_id' => 3,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+@[A-Z0-9.-]+'),
            'time' => Carbon::now()->addMinutes(21),
            'reserved_min' => 25,
            'isnotify' => 0,
            'isAccept' => 'no'
        ]);
        UserQueue::create([
            'user_id' => 3,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+@[A-Z0-9.-]+'),
            'time' => Carbon::now()->addMinutes(25),
            'reserved_min' => 23,
            'isnotify' => 1,
            'isAccept' => 'no'
        ]);
        UserQueue::create([
            'user_id' => 4,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+[A-Z0-9.-]+'),
            'time' => Carbon::now()->subMinutes(10),
            'reserved_min' => 22,
            'isnotify' => 1,
            'isAccept' => 'yes'
        ]);

         UserQueue::create([
            'user_id' => 3,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+[A-Z0-9.-]+'),
            'time' => Carbon::now(),
            'reserved_min' => 20,
            'isnotify' => 1,
            'isAccept' => 'no'
        ]);

        UserQueue::create([
            'user_id' => 4,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+@[A-Z0-9.-]+'),
            'time' => Carbon::now()->addMinutes(50),
            'reserved_min' => 10,
            'isnotify' => 0,
            'isAccept' => 'no'
        ]);


        UserQueue::create([
            'user_id' => 3,
            'captcha' => $faker->regexify('[A-Z0-9._%+-]+@[A-Z0-9.-]+'),
            'time' => Carbon::now()->addMinutes(50),
            'reserved_min' => 10,
            'isnotify' => 0,
            'isAccept' => 'no'
        ]);
    }
}

class MainQueueSeeder extends Seeder{
    public function run() {    
        MainQueue::truncate();
        // opening
        $faker = Faker::create();
        $opening = MainQueue::create([
            'name' => 'Test Queue 1[Opening]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDay(),
            'service_end' => Carbon::now()->addDay()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDays(2),
            'close' => Carbon::now()->addHour(),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 2
        ]);

        $opening->userqueue()->sync([1,5]);

        // waiting
        MainQueue::create([
            'name' => 'Test Queue 2[Waiting]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDays(2),
            'service_end' => Carbon::now()->addDays(2)->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->addDays(2),
            'close' => Carbon::now()->addDay(4),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 5
        ]);
        //closed
        $closed = MainQueue::create([
            'name' => 'Test Queue 3[closed]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDays(2),
            'service_end' => Carbon::now()->addDays(2)->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->subDays(3),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 5
        ]);

        //Running
        $running = MainQueue::create([
            'name' => 'Test Queue 4[running]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now(),
            'service_end' => Carbon::now()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->subDays(2),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 2
        ]);
        $running->userqueue()->sync([3,4]);
        
         $opening = MainQueue::create([
            'name' => 'Test Queue 5[Opening]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDay(),
            'service_end' => Carbon::now()->addDay()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->addHours(3),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 2
        ]);

         $opening = MainQueue::create([
            'name' => 'Test Queue 6[Op & St]',
            'queuetype_id' => 1,
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDay(),
            'service_end' => Carbon::now()->addDay()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->addHours(2),
            'max' => $faker->numberBetween($min = 10, $max = 10),
            'user_id' => 2
        ]);

        $opening->userqueue()->sync([2]);

        $opening = MainQueue::create([
            'name' => 'Test Queue 7[Op & St]',
            'queuetype_id' => 1,
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addDay(),
            'service_end' => Carbon::now()->addDay()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDays(2),
            'close' => Carbon::now()->addHour(),
            'max' => $faker->numberBetween($min = 10, $max = 13),
            'user_id' => 5
        ]);

        $opening->userqueue()->sync([6]);

        $running = MainQueue::create([
            'name' => 'Test Queue 8[running]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addMinutes(5),
            'service_end' => Carbon::now()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->subDays(2),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 5
        ]);
       

        $running = MainQueue::create([
            'name' => 'Test Queue 9[running]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now(),
            'service_end' => Carbon::now()->addHours(7),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->subDays(2),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 5
        ]);
        $running = MainQueue::create([
            'name' => 'Test Queue 10[running]',
            'queuetype_id' => $faker->numberBetween($min = 1, $max = 14),
            'counter' => $faker->numberBetween($min = 1, $max = 5),
            'service_start' => Carbon::now()->addMinutes(15),
            'service_end' => Carbon::now()->addHours(3),
            'max_minutes' => $faker->numberBetween($min = 20, $max = 60),
            'open' => Carbon::now()->subDay(),
            'close' => Carbon::now()->subDays(2),
            'max' => $faker->numberBetween($min = 10, $max = 16),
            'user_id' => 2
        ]);
       
      
    }
}

